Enums/ВидКонтактнойИнформации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВидКонтактнойИнформации</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>СМС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Телеграмм</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Почта</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Пуш</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Календарь</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВебСокет</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

CommonModules/ОповещенияПереопределяемый/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

// Оповещает пользователя в соответствии с указанным видом контактной информации.
//
// Параметры:
//   Пользователь - СправочникСсылка.Пользователи - пользователь, которого необходимо оповестить
//   ВидКонтактнойИнформации - ПеречислениеСсылка.ВидКонтактнойИнформации - вид контактной информации для оповещения
//   ТекстУведомления - Строка - текст уведомления, которое будет отправлено пользователю
//   Тема - Строка - тема уведомления (используется для почты)
Процедура ОповеститьПользователя(Пользователь, ВидКонтактнойИнформации, ТекстУведомления, Тема = "") Экспорт
	Если ВидКонтактнойИнформации = Перечисления.ВидКонтактнойИнформации.СМС Тогда
		ОтправитьСМС(Пользователь.Телефон, ТекстУведомления);
		
	ИначеЕсли ВидКонтактнойИнформации = Перечисления.ВидКонтактнойИнформации.Телеграмм Тогда
		ОтправитьТелеграмм(Пользователь.ТелеграммИД, ТекстУведомления);
		
	ИначеЕсли ВидКонтактнойИнформации = Перечисления.ВидКонтактнойИнформации.Почта Тогда
		ОтправитьПисьмо(Пользователь.Почта, Тема, ТекстУведомления);
		
	Иначе
		Сообщить("Не указан вид контактной информации ддя информрования " + Пользователь);
		
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ОтправитьСМС(НомерТелефона, Текст)
	Сообщить(СтрШаблон("Отправлено СМС на номер %1: %2", НомерТелефона, Текст));
КонецФункции

Функция ОтправитьТелеграмм(ТелеграммИД, Текст)
	Сообщить(СтрШаблон("Отправлено сообщение в телеграмм ИД %1: %2", ТелеграммИД, Текст));
КонецФункции

Функция ОтправитьПисьмо(АдресПочты, Тема, Тело)
	Сообщить(СтрШаблон("Отправлено письмо на адрес %1: Тема %2, Содержимое: %3", АдресПочты, Тема, Тело));
КонецФункции

#КонецОбласти
